app/views/days/index.html.erb

SELECT "days".* FROM "days"
---
                        <% if card.email == student.email %>
                            <% if card.day_ids.include? day.id %>