app/views/courses/index.html.erb

SELECT "courses".* FROM "courses"
---

<% unless @teacher.courses.blank? %>