app/views/courses/show.html.erb

      <td>
        <% student.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 3]]