app/views/cards/index.html.erb


  <% @course.cards.each do |card| %>
---
SELECT "cards".* FROM "cards"