app/controllers/cards_controller.rb

    def index
        @course = Course.find(params[:course_id])
        @cards = @course.cards.all
        @day = Day.find(params[:day_id])
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @card = Card.new(card_params)
        @course = Course.find(params[:course_id])
        @day = Day.find(params[:day_id])
        @teacher = @course.teacher_id
        @students = @course.students

        @card_updated = false;

        # code doesn't exist in entire database and no email is linked to it
        if !code_exist(@card.code) && @card.email == nil
            # redirect_to course_day_card_promptemail_path(@course, @day, @card)
            # puts('EMAIL PROMPTED!!!')
            render 'prompt_email'
        # code doesn't exist in entire database, but there is email linked to it
        elsif !code_exist(@card.code) && @card.email != nil
            # check if linked email is in course's cards' emails
            if email_exist_in_course(@card.email, @course)
                # if email of card is connected to a card, use that (if student changes tamu id card)
                if @card.save
                    @course.cards << @card
                    @day.cards << @card
                    #Student.where(email: @card.email).first.card_num = @card.code

                    # update student and card attribute (link email and card number)
                    @student = @students.where(email: @card.email).first
                    @student.update_attribute(:card_num, @card.code)
                    if !@student.prefname.nil?
                        @card.preferredname = @student.prefname
                    end
                    @card.firstname = @student.fname
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards"