app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
    def index
        @cards = Card.all

SELECT  "cards".* FROM "cards" ORDER BY "cards"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def new
        @card = Card.new
        @lastCard = Card.last

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cards" ("code", "created_at", "updated_at") VALUES (?, ?, ?)  [["code", "4"], ["created_at", "2020-02-22 22:23:47.904710"], ["updated_at", "2020-02-22 22:23:47.904710"]]
---
    def create
        @card = Card.new(card_params)
        @course = Course.find(params[:course_id])

        if code_exist(@card.code)
            render 'promptEmail'
        elsif @card.save

SELECT "cards".* FROM "cards"
---
    def code_exist(code)
        #return value 'ret'
        ret = false
        for card in Card.all do