app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def import
        @course = Course.find(params[:id])
        @students_in_course = @course.students.all

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @course = Course.find(params[:id])

INSERT INTO "courses" ("name", "section", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asf"], ["section", 222], ["created_at", "2020-01-27 21:37:53.302771"], ["updated_at", "2020-01-27 21:37:53.302771"]]
---
    def create
        @course = Course.new(course_params)
        @teacher = Teacher.find(params[:teacher_id])

        if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def update
        @course = Course.find(params[:id])