app/controllers/days_controller.rb

  def index
    @course = Course.find(params[:course_id])

    @courses = Course.all

    @tookattendance = time_exist(@course)
    @time = Time.now.in_time_zone('Central Time (US & Canada)').strftime("%m-%d-%Y")
    @days = @course.days
    @day = @days.where(classday: @time).first
    @all_days = Day.all
    @cards = @course.cards

    if !params[:days]
      @students = @course.students.order(sort_column + " " + sort_direction)
    else
      @students = @course.students.order(sort_column_day + " " + sort_direction)
    end

    if(@course.days.first)
---
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]
SELECT  "days".* FROM "days" LIMIT ?  [["LIMIT", 11]]