app/controllers/days_controller.rb

SELECT "days".* FROM "days"
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "days".* FROM "days" WHERE "days"."classday" = ? ORDER BY "days"."id" ASC LIMIT ?  [["classday", "02-16-2020"], ["LIMIT", 1]]
---
  def index
    @days = Day.all
    @course = Course.find(params[:course_id])
    @tookattendance = time_exist
    @time = Time.now.in_time_zone('Central Time (US & Canada)').strftime("%m-%d-%Y")
    @day = Day.where(classday: @time).first

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @day = Day.new
    @course = Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "days" ("classday", "created_at", "updated_at") VALUES (?, ?, ?)  [["classday", "02-22-2020"], ["created_at", "2020-02-22 21:58:43.465008"], ["updated_at", "2020-02-22 21:58:43.465008"]]
---
  def create
    @day = Day.new(day_params)
    @course = Course.find(params[:course_id])

    @day.classday = Time.now.in_time_zone('Central Time (US & Canada)').strftime("%m-%d-%Y")

    if @day.save!

SELECT "days".* FROM "days"
---
  def time_exist
    #return value 'ret'
    ret = false
    time = Time.now.in_time_zone('Central Time (US & Canada)').strftime("%m-%d-%Y")
    for day in Day.all do