app/controllers/home_controller.rb

SELECT  "homes".* FROM "homes" WHERE "homes"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
---
  def index
    #@homes = Home.all
    @homes = Home.order(:name, :lname)

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    #note to self, when call redirect_to @object, it automatically goes to show
    @home = Home.find(params[:id])

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @home = Home.find(params[:id])

INSERT INTO "homes" ("card", "name", "lname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card", "%6016426594017846?;6016426594017846?+6016426594017846?"], ["name", "HAHAH"], ["lname", "BRUH"], ["created_at", "2020-02-10 04:51:33.707157"], ["updated_at", "2020-02-10 04:51:33.707157"]]
INSERT INTO "homes" ("card", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card", "dfg"], ["name", "fgh"], ["created_at", "2020-01-31 23:39:44.829766"], ["updated_at", "2020-01-31 23:39:44.829766"]]
---
  def create
    @home = Home.new(home_params)
    @home = Home.create(params.require(:home).permit(:card, :name, :lname))

    if @home.save

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "homes" SET "card" = ?, "name" = ?, "updated_at" = ? WHERE "homes"."id" = ?  [["card", "%6016426593028653?;6016426593028653?+6016426593028653?"], ["name", "fg"], ["updated_at", "2020-02-09 22:09:36.138829"], ["id", 1]]
---
  def update
    @home = Home.find(params[:id])
    @home.update(params.require(:home).permit(:card, :name, :lname))

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "homes" WHERE "homes"."id" = ?  [["id", 4]]
---
  def destroy
    @home = Home.find(params[:id])
    @home.destroy