app/controllers/student_controller.rb

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    #note to self, when call redirect_to @object, it automatically goes to show
    @student = Home.find(params[:id])

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @student = Home.find(params[:id])