app/controllers/students_controller.rb

    def show
        @student = Student.find(params[:id])
        @courses = @student.courses.all

        #dictates which path to take in html
        @coursespage = params[:course_id].present?
        @isTeacher = Teacher.pluck(:email).include? session[:email]
        @isAdmin = (Admin.pluck(:email).include? session[:email])
        @isnotstudent = (@isTeacher) || (Admin.pluck(:email).include? session[:email])

        #prevents errors
        if params[:course_id].present?
            @course = Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

    def destroy
        #if deleting student from course
        if params[:course_id].present?
            @course = Course.find(params[:course_id])
            @course.students.delete(Student.find(params[:id]))

            redirect_to course_path(@course)
        #if deleting student from database
        else
            @student = Student.find(params[:id])
            @courses = @student.courses

            for course in @courses do
                @card = course.cards.where(email: @student.email).first
                course.students.delete(Student.find(params[:id]))
            end
            if !@card.nil?
                @card.destroy
            end

            @student.destroy
---
DELETE FROM "courses_students" WHERE "courses_students"."student_id" = ?  [["student_id", 2]]