app/controllers/students_controller.rb

    def show
        @student = Student.find(params[:id])
        @courses = @student.courses.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @student = Student.new(student_params)
        @course = Course.find(params[:course_id])
        @teacher = @course.teacher_id

        if exist_email(@student.email)
        begin
            @existStudent = Student.where(email: @student.email).first
            if !email_in_course(@course, @student.email)
                @existStudent.courses << @course
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."email" = ? ORDER BY "students"."id" DESC LIMIT ?  [["email", "rdj772@tamu.edu"], ["LIMIT", 1]]
INSERT INTO "students" ("fname", "mname", "lname", "prefname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fname", "Reegan"], ["mname", "D"], ["lname", "Jiang"], ["prefname", ""], ["email", "rdj772@tamu.edu"], ["created_at", "2020-02-15 23:59:55.472008"], ["updated_at", "2020-02-15 23:59:55.472008"]]

    def update
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def destroy
        @student = Student.find(params[:id])
        @course = Course.find(params[:course_id])
        @course.students.delete(Student.find(params[:id]))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 3]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]